---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.LayerElemBaseConstraint
source: html/9759ed09-9c87-c6ba-dceb-9c59de079df9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.LayerElemBaseConstraint Property

"Base Constraint"

## Syntax (C#)
```csharp
public static ForgeTypeId LayerElemBaseConstraint { get; }
```